УТ/src/Catalogs/CRM_УсловияОбработкиОбращений/CRM_УсловияОбработкиОбращений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_УсловияОбработкиОбращений</name>
  <predefined>
    <items>
      <name>БезУсловия</name>
      <description>Без условия</description>
    </items>
  </predefined>
  <attributes>
    <name>ВидУсловия</name>
    <type>
      <types>EnumRef.CRM_ВидыУсловийОбработкиОбращений</types>
    </type>
  </attributes>
  <attributes>
    <name>Метка</name>
    <type>
      <types>CatalogRef.CRM_МеткиКлассификации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИскомыеСтроки</name>
    <attributes>
      <name>Строка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИскатьКакСлово</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ/src/Enums/CRM_ВидыУсловийОбработкиОбращений/CRM_ВидыУсловийОбработкиОбращений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CRM_ВидыУсловийОбработкиОбращений</name>
  <enumValues>
    <name>СписокСлов</name>
  </enumValues>
  <enumValues>
    <name>МеткаПомощника</name>
  </enumValues>
  <enumValues>
    <name>АдресОтправителя</name>
  </enumValues>
  <enumValues>
    <name>СписокТелефонныхНомеров</name>
  </enumValues>
</mdclass:Enum>

УТ/src/Catalogs/CRM_УсловияОбработкиОбращений/Forms/ФормаВыбора/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭлементОтбораДанных = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбораДанных.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидУсловия");
	Если Параметры.Свойство("ИсточникОткрытияТелефония") Тогда
		ИсточникТелефония = Истина;
		ЭлементОтбораДанных.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Иначе
		ЭлементОтбораДанных.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	КонецЕсли;
	ЭлементОтбораДанных.ПравоеЗначение = Перечисления.CRM_ВидыУсловийОбработкиОбращений.СписокТелефонныхНомеров;
	ЭлементОтбораДанных.Использование = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	Если ИсточникТелефония Тогда
		СтандартнаяОбработка = Ложь;
		ТекущаяСтрока = Элементы.Список.ТекущаяСтрока;
		
		ПараметрыВвода = Новый Структура("Ключ, ИсточникОткрытияТелефония", ТекущаяСтрока, Истина);

		ОткрытьФорму("Справочник.CRM_УсловияОбработкиОбращений.Форма.ФормаЭлемента", ПараметрыВвода,
			 ЭтотОбъект, УникальныйИдентификатор, , , ,
			 РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если ИсточникТелефония Тогда
		СтандартнаяОбработка = Ложь;
		
		ПараметрыВвода = Новый Структура("ИсточникОткрытияТелефония", Истина);
		
		ОткрытьФорму("Справочник.CRM_УсловияОбработкиОбращений.Форма.ФормаЭлемента", ПараметрыВвода,
			 ЭтотОбъект, , , , ,
			 РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
